/**
 * Реализуйте метод, выполняющий численное интегрирование заданной функции на заданном интервале по формуле
 * левых прямоугольников.
 * Функция задана объектом, реализующим интерфейс java.util.function.DoubleUnaryOperator. Его метод applyAsDouble()
 * принимает значение аргумента и возвращает значение функции в заданной точке.
 * Интервал интегрирования задается его конечными точками a и b, причем a<=b. Для получения достаточно точного
 * результата используйте шаг сетки не больше 10−6.
 */
package com.jm.Stepik_03_05_01; 

public class Main {
}
